
&НаСервере
&ИзменениеИКонтроль("ПодготовитьФормуНаСервере")
Процедура Спринт11_ПодготовитьФормуНаСервере()

	УстановитьФункциональныеОпцииФормы();

	УстановитьСостояниеДокумента();

	ТекущаяДатаДокумента = Объект.Дата;

	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();

	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) 
		и ЗначениеЗаполнено(Объект.Контрагент)
		и НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		и НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ПоступлениеТоваровУслугФормы.КонтрагентПриИзменении(ЭтотОбъект);
	ИначеЕсли ВестиУчетПоДоговорам И ПоступлениеТоваровУслугФормы.ДоступноСозданиеОсновногоДоговораПоВидуОперации(Объект.ВидОперации) Тогда
		ПредлагатьНовыйДоговор = РаботаСДоговорамиКонтрагентовБП.ПредлагатьНовыйДоговор(Объект.Организация, Объект.Контрагент);
	КонецЕсли;

	ПоступлениеТоваровУслугФормы.УстановитьПараметрыПоДоговору(ЭтотОбъект);

	ПоступлениеТоваровУслугФормы.УстановитьПараметрыВыбора(ЭтотОбъект);

	Если НТТ И РассчитыватьСуммаВРознице И Объект.Товары.Количество() > 0 Тогда

		ТоварыСвернуты	= Истина;
		Для каждого СтрокаТовары Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
				ТоварыСвернуты	= Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;

	Иначе
		ТоварыСвернуты	= Ложь;
	КонецЕсли;

	СвойстваСчета4112 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(
	ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	РазделениеПоСтавкамВРознице = СвойстваСчета4112.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС
	ИЛИ СвойстваСчета4112.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС
	ИЛИ СвойстваСчета4112.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС;

	ЗаполнитьДобавленныеКолонкиТаблиц();

	ПоставщикРезидентТаможенногоСоюза = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Объект.Контрагент);

	НастроенОбменЭПД = ОбменСГИСЭПДБП.ДокументооборотНастроен(Объект.Организация, Объект.Контрагент);
	Если НастроенОбменЭПД Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбменСКонтрагентамиБП.РеквизитыЭТрН(Объект.Ссылка));
	КонецЕсли; 

	ЕстьПравоСозданиеЭТрН = ПравоДоступа("Изменение", Метаданные.Документы.ЭлектроннаяТранспортнаяНакладная);

	// Для заполненного документа сразу выводим напоминание об уведомлении в подвале документа если требуется.
	ТребуетсяНапоминание = ТребуетсяНапоминаниеОбУведомленииОВвозе(ЭтотОбъект);
	УстановитьПредставлениеНадписиУведомлениеОВвозе();

	УстановитьВидимостьПроверкиРНПТ();

	ПоступлениеТоваровУслугФормы.УстановитьПорядокУчетаРасчетов(ЭтотОбъект);

	ПоступлениеТоваровУслугФормыКлиентСервер.СформироватьНадписьЦеныИВалюта(ЭтотОбъект);

	ОбновитьИтоги(ЭтотОбъект);

	ПоступлениеТоваровУслугФормыКлиентСервер.УстановитьТребуетсяСчетФактура(ЭтотОбъект);
	ПоступлениеТоваровУслугФормыКлиентСервер.ЗаполнитьРеквизитыПроСчетФактуру(ЭтотОбъект);
	ПоступлениеТоваровУслугФормы.ЗаполнитьРеквизитыУПД(ЭтотОбъект);

	СтатусыОригиналовДокументов = ПоступлениеТоваровУслугФормыВызовСервера.СтатусыОригиналовДокументов(
	Объект.Ссылка, СчетФактура);
	ОригиналПолучен      = СтатусыОригиналовДокументов[Объект.Ссылка];
	ОригиналСчетаФактуры = СтатусыОригиналовДокументов[СчетФактура];
	ПолученЧекНПД        = СтатусыОригиналовДокументов[ЧекиНПДКлиентСервер.ИмяСтатусаЧекаНПД()];

	УчетОригиналовПервичныхДокументовБП.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, ОригиналПолучен);

	Если ЗначениеЗаполнено(СчетФактура) Тогда
		Продавец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "Продавец");
	КонецЕсли;

	ЗаявлениеОВвозеТоваровОтКомиссионера = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Продавец)
	И ЭтоКомиссияНаЗакупку
	И ТекущаяДатаДокумента >= '20240101';

	УправлениеФормой(ЭтотОбъект);

	УстановитьВидимость();

	ПоступлениеТоваровУслугФормыКлиентСервер.УстановитьВидимостьКолонокРасхождения(ЭтотОбъект, "Товары");

	ПоступлениеТоваровУслугФормы.УстановитьЗаголовокФормы(ЭтотОбъект);

	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не ОбщегоНазначения.ПустойБуферОбмена());
	
	#Вставка
	//+Иващенко Андрей
	//Добавлен вызов процедуры заполнения ставок НДС
	СтавкиНДС = Спринт11_ЗаполнитьСтавкиНДС(Объект.Ссылка);
	//-Иващенко Андрей
	#КонецВставки
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Спринт11_ЗаполнитьСтавкиНДС(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтавкаНДС";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивСтавокНДС = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтавкаНДС");
		Возврат СтрСоединить(МассивСтавокНДС, ",");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

