
&ИзменениеИКонтроль("ПодготовитьПараметрыПроведения")
Функция Спринт11_ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения)

	ВалютаРеглУчета     = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ЭтоОтложенноеПроведение = ЗначениеЗаполнено(ДоговорДляОтложенногоПроведения);

	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("ВалютаРеглУчета", ВалютаРеглУчета);
	ПараметрыПроведения.Вставить("ДокументСсылка",  ДокументСсылка);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",          ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ЭтоОтложенноеПроведение", 			ЭтоОтложенноеПроведение);
	Запрос.УстановитьПараметр("ДоговорДляОтложенногоПроведения", 	ДоговорДляОтложенногоПроведения);

	ПодготовитьПараметрыРеквизитыДокумента(Запрос, ПараметрыПроведения, Отказ);

	Реквизиты = ПараметрыПроведения.ТаблицаРеквизиты[0];
	Если Отказ ИЛИ НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Дата, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	ПлательщикНДФЛ = УчетнаяПолитика.ПлательщикНДФЛ(Реквизиты.Организация, Реквизиты.Дата);

	ПараметрыПроведения.Вставить("ПлательщикНДФЛ", ПлательщикНДФЛ);

	Запрос.УстановитьПараметр("ПлательщикНДФЛ",                 ПлательщикНДФЛ);
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",        УчетнаяПолитика.ПрименяетсяУСН(Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",  УчетнаяПолитика.ПрименяетсяУСНПатент(Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ВестиУчетПоВидамДеятельностиИП", УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОсновнаяНоменклатурнаяГруппа",   УчетнаяПолитика.ОсновнаяНоменклатурнаяГруппа(Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("Содержание",                     Реквизиты.Содержание);
	Запрос.УстановитьПараметр("ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств", УчетнаяПолитика.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств(
	Реквизиты.Организация, Реквизиты.Дата));
	Если Реквизиты.БезЗакрывающихДокументов Тогда
		Запрос.УстановитьПараметр("ОсновнойСчетУчетаЗатрат", УчетнаяПолитика.ОсновнойСчетУчетаЗатрат(
		Реквизиты.Организация, Реквизиты.Дата));
		Запрос.УстановитьПараметр("ОсновнаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ОсновнаяСтатьяЗатрат());
		Запрос.УстановитьПараметр("ОсновноеПодразделение", 
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации"));
		Запрос.УстановитьПараметр("ПрочиеВнереализационныеДоходыРасходы",
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы"));
	КонецЕсли;

	Запрос.УстановитьПараметр("БезНомера", НСтр("ru = 'б/н'"));

	Для каждого Колонка Из ПараметрыПроведения.ТаблицаРеквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	+ ТекстЗапросаТаблицыДокумента(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПогашениеЗадолженности(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаВыплатаДепонентов(НомераТаблиц,        ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПрочееСписание(НомераТаблиц,           ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаВыплатаЗарплаты(НомераТаблиц,          ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПоступлениеМПЗИП(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеНалогаИП(НомераТаблиц,     ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаСчетов(НомераТаблиц,             ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаПоДоговорамПодряда(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаВыплатаДивидендов(НомераТаблиц,        ПараметрыПроведения, Реквизиты)
	#Вставка
	//+ Иващенко Андрей
	// Добавляем текст запроса для движения по регистру Спринт11_ОплатыПоСтатьямДДС
	+ТекстЗапросаСпринт11_ОплатыПоСтатьямДДС(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	//- Иващенко Андрей
	#КонецВставки
	;

	Результат = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Реквизиты = ПараметрыПроведения.Реквизиты[0];

	Если Реквизиты.ЭтоВыплатаЗарплаты Тогда
		Ведомости = Новый Массив;
		ТаблицыОплатыТруда = ПолучитьТаблицыОплатыТруда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыТруда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ВыплатаЗарплаты", ТаблицыОплатыТруда);
		КонецЕсли;
	ИначеЕсли Реквизиты.ЭтоВыплатаПоДоговоруПодряда Тогда
		Ведомости = Новый Массив;
		ТаблицыОплатыДоговоровПодряда = ПолучитьТаблицыОплатыДоговоровПодряда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыДоговоровПодряда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ОплатаПоДоговорамПодряда", ТаблицыОплатыДоговоровПодряда);
		КонецЕсли;
	Иначе
		Реквизиты.Содержание = ТекстСодержанияПроводокДокумента(Реквизиты);
	КонецЕсли;

	Если ПараметрыПроведения.РасшифровкаПлатежа <> Неопределено Тогда
		ПараметрыПроведения.РасшифровкаПлатежа.ЗаполнитьЗначения(Реквизиты.Содержание, "Содержание");
	КонецЕсли;

	Возврат ПараметрыПроведения;

КонецФункции

Функция ТекстЗапросаСпринт11_ОплатыПоСтатьямДДС(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику Тогда
		ПараметрыПроведения.Вставить("Спринт11_ОплатыПоСтатьямДДС", Неопределено);
		Возврат "";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Дата КАК Период,
		|	РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	РасходныйКассовыйОрдер.ДоговорКонтрагента КАК Договор,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.Спринт11_Ответственный КАК Ответственный,
		|	СУММА(РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов) КАК Сумма
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|		ПО РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = РасходныйКассовыйОрдер.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйКассовыйОрдер.Дата,
		|	РасходныйКассовыйОрдер.Контрагент,
		|	РасходныйКассовыйОрдер.ДоговорКонтрагента,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.Спринт11_Ответственный";
		
		НомераТаблиц.Вставить("Спринт11_ОплатыПоСтатьямДДС", НомераТаблиц.Количество());
		
		Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
		
	КонецЕсли;
	
КонецФункции
