
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Спринт11_ОбработкаПроведения(Отказ, Режим)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.СписаниеСРасчетногоСчета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	#Вставка
	//+ Иващенко Андрей
	// Добавляем таблицу для регистра Спринт11_ОплатыПоСтатьямДДС
	ТаблицаСпринт11_ОплатыПоСтатьямДДС = ПараметрыПроведения.Спринт11_ОплатыПоСтатьямДДС;
	//- Иващенко Андрей
	#КонецВставки

	ТаблицаВзаиморасчеты  = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(
	ПараметрыПроведения.РасшифровкаПлатежа, ПараметрыПроведения.Реквизиты, Отказ);

	ТаблицаСуммовыхРазниц = УчетНДС.ПодготовитьТаблицуСуммовыхРазниц(ТаблицаВзаиморасчеты,
	ПараметрыПроведения.Реквизиты, Отказ);

	// Структура таблиц для отражения в налоговом учете УСН
	ТаблицаВыплатаЗарплаты         = УчетЗарплаты.ПолучитьТаблицуВыплатыЗарплатыДляУСН(ПараметрыПроведения.ПеречислениеЗарплаты);
	ТаблицаВыплатаДепонентов       = УчетЗарплаты.ПолучитьТаблицуВыплатыЗарплатыДляУСН(ПараметрыПроведения.ПеречислениеДепонентов);
	ТаблицаВыплатаДоговоровПодряда = УчетЗарплаты.ПолучитьТаблицуВыплатыЗарплатыДляУСН(ПараметрыПроведения.ОплатаПоДоговорамПодряда);
	ТаблицаПеречислениеПоИсполнительномуЛисту = УчетЗарплаты.ПолучитьТаблицуВыплатыПоИСполнительномуЛистуДляУСН(ПараметрыПроведения.Реквизиты,
	ПараметрыПроведения.ПеречислениеПоИсполнительномуЛистуРаботника);

	СтруктураТаблицУСН = Новый Структура;
	СтруктураТаблицУСН.Вставить("ТаблицаРасчетов",                ТаблицаВзаиморасчеты);
	СтруктураТаблицУСН.Вставить("ТаблицаВыплатаЗарплаты",         ТаблицаВыплатаЗарплаты);
	СтруктураТаблицУСН.Вставить("ТаблицаПеречислениеНДФЛ",        ПараметрыПроведения.ПеречислениеНДФЛ);
	СтруктураТаблицУСН.Вставить("ТаблицаВыплатаДепонентов",       ТаблицаВыплатаДепонентов);
	СтруктураТаблицУСН.Вставить("ТаблицаВыплатаДоговоровПодряда", ТаблицаВыплатаДоговоровПодряда);
	СтруктураТаблицУСН.Вставить("ТаблицаВыплатаСамозанятым",      ПараметрыПроведения.ВыплатыСамозанятым);
	СтруктураТаблицУСН.Вставить("ТаблицаПеречислениеПоИсполнительномуЛисту", ТаблицаПеречислениеПоИсполнительномуЛисту);
	СтруктураТаблицУСН.Вставить("ТаблицаУплатыПоЕдиномуНалоговомуСчету", Неопределено);

	ТаблицаУплатаТорговогоСбораУСН = УчетУСН.ПодготовитьТаблицуУплатыТорговогоСбораДляРаздела5КУДиР(
	ПараметрыПроведения.РасшифровкаПлатежаПрочее, ПараметрыПроведения.Реквизиты);

	// Разметка операций Автоматизированной УСН
	ТаблицаРазметкиАУСН = РазметкаОперацийАУСН.ПодготовитьТаблицуСписаниеДенежныхСредств(
	ПараметрыПроведения.РеквизитыАУСН,
	ТаблицаВзаиморасчеты,
	ПараметрыПроведения.ПеречислениеЗарплаты,
	ПараметрыПроведения.РазметкаАУСНБанка);

	// Учет доходов и расходов ИП
	ТаблицыОплатыПоставщикуИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыОплатыПоставщику(
	ТаблицаВзаиморасчеты,
	ПараметрыПроведения.Реквизиты);

	ТаблицаОплатыОСиНМА = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуОплатыОСиНМА(
	ТаблицыОплатыПоставщикуИП, 
	ПараметрыПроведения.Реквизиты);

	ТаблицаУслугИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступленияМПЗ(
	ПараметрыПроведения.ПоступлениеМПЗИПТаблицаУслуг,
	ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты);

	СтруктураТаблицМПЗ = Новый Структура("ТаблицаУслуг", ТаблицаУслугИП);

	ТаблицыУплатаНалогов = Новый Структура;
	ТаблицыУплатаНалогов.Вставить("ПеречислениеНалогов",                   ПараметрыПроведения.РасшифровкаПлатежаПрочее);
	ТаблицыУплатаНалогов.Вставить("ПеречислениеНДФЛ",                      ПараметрыПроведения.ПеречислениеНДФЛ);
	ТаблицыУплатаНалогов.Вставить("ПеречислениеНалогаИП",                  ПараметрыПроведения.ПеречислениеНалогаИПТаблица);
	ТаблицыУплатаНалогов.Вставить("ТаблицаУплатыПоЕдиномуНалоговомуСчету", Неопределено);

	ТаблицыУплатыВзносовФОТИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыУплатыВзносовФОТ(
	ТаблицыУплатаНалогов, ПараметрыПроведения.Реквизиты);

	ТаблицыВыплатыЗарплатыИП   = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыВыплатыЗарплаты(
	ПараметрыПроведения.ПеречислениеЗарплаты, ПараметрыПроведения.Реквизиты);

	ТаблицыВыплатыДепонентовИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыВыплатыЗарплаты(
	ПараметрыПроведения.ПеречислениеДепонентов, ПараметрыПроведения.Реквизиты);

	ТаблицыВыплатыПоДоговорамПодрядаИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыВыплатыЗарплаты(
	ПараметрыПроведения.ОплатаПоДоговорамПодряда, ПараметрыПроведения.Реквизиты);

	ТаблицаУдержанийИП = УчетЗарплаты.ПолучитьТаблицуПрочихУдержанийИП(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
	ПараметрыПроведения.ПеречислениеПоИсполнительномуЛистуРаботникаИП);
	ТаблицыПрочихУдержанийИП   = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыПеречислениеПрочихУдержаний(
	ТаблицаУдержанийИП, ПараметрыПроведения.Реквизиты);

	ТаблицыВыплатаДивидендовФизическомуЛицу = УчетЗарплаты.ПодготовитьТаблицуВыплатаДивидендов(
	ПараметрыПроведения.ВыплатаДивидендов);

	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		ТаблицаСтатусовСчетов = СтатусыДокументов.ПодготовитьТаблицуСтатусовОплатыСчетов(
		ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты);
	КонецЕсли;

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	#Вставка
	//+ Иващенко Андрей
	// Добавляем коллекцию движений для регистра Спринт11_ОплатыПоСтатьямДДС
	Спринт11_ОплатыПоСтатьямДДС.СформироватьДвиженияДляСпринт11_ОплатыПоСтатьямДДС(ТаблицаСпринт11_ОплатыПоСтатьямДДС, Движения, Отказ);
	//- Иващенко Андрей
	#КонецВставки

	УчетВзаиморасчетов.СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчеты,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	ВыплатыСамозанятым.СформироватьДвиженияВыплатыСамозанятым(ПараметрыПроведения.ВыплатыСамозанятым,
	ПараметрыПроведения.РеквизитыВыплатыСамозанятым, Движения, Отказ);

	ВыплатыСамозанятым.СформироватьДвиженияЗадолженностиСамозанятыхПоРеестру(ПараметрыПроведения.ВыплатыСамозанятым,
	ПараметрыПроведения.РеквизитыВыплатыСамозанятым, Движения, Отказ);
	ВыплатыСамозанятым.УстановитьСостояниеДокументаПриОплате(
	ПараметрыПроведения.РеквизитыВыплатыСамозанятым, Движения, Отказ);

	НачалоПростогоУчета = ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	Если Дата < НачалоПростогоУчета Тогда
		ЕдиныйНалоговыйСчет.ЗарегистрироватьЗачислениеНаЕдиныйНалоговыйСчет(ПараметрыПроведения.Реквизиты,
		ПараметрыПроведения.РасшифровкаПлатежаПрочее, Движения, Отказ);
	КонецЕсли;

	УчетДоходовРасходов.СформироватьДвиженияСуммовыеРазницыРасчетыВУЕ(ТаблицаСуммовыхРазниц,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияПеречислениеВыплатаЗарплаты(ЭтотОбъект, ПараметрыПроведения.ПеречислениеЗарплаты,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияОплатаПоДоговорамПодряда(ЭтотОбъект, ПараметрыПроведения.ОплатаПоДоговорамПодряда,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияВыплатаДепонентов(ПараметрыПроведения.ПеречислениеДепонентов,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УставныйКапитал.СформироватьДвиженияВыплатаДивидендов(ПараметрыПроведения.ВыплатаДивидендов,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияВыплатаДивидендов(ТаблицыВыплатаДивидендовФизическомуЛицу,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДенежныхСредств.СформироватьДвиженияПрочееСписание(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияПоНалогамИВзносамСФОТ(ПараметрыПроведения.Реквизиты,
	ТаблицыУплатаНалогов, Движения, Отказ);

	УчетЗарплаты.СформироватьДвиженияПеречислениеПоИсполнительномуЛистуРаботника(ПараметрыПроведения.ПеречислениеПоИсполнительномуЛистуРаботника,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетНДС.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
	ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчеты, Движения, Отказ);

	УчетНДСРаздельный.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
	ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчеты, Движения, Отказ);

	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);

	УчетУСН.СформироватьДвиженияКУДиРРаздел5(ТаблицаУплатаТорговогоСбораУСН,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	РазметкаОперацийАУСН.СформироватьДвиженияРазметки(ПараметрыПроведения.РеквизитыАУСН,
	ТаблицаРазметкиАУСН, Движения);

	СтатусыДокументов.СформироватьДвиженияОплатаСчетов(
	ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияОплатаПоставщику(
	ТаблицыОплатыПоставщикуИП, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатыСамозанятым(
	ПараметрыПроведения.ВыплатыСамозанятымИП,
	ПараметрыПроведения.РеквизитыВыплатыСамозанятым, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеМПЗ(СтруктураТаблицМПЗ,
	ПараметрыПроведения.ПоступлениеМПЗИПТаблицаВзаиморасчетов,,
	ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаНДФЛ(
	ТаблицыУплатаНалогов,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаВзносовФОТ(
	ТаблицыУплатыВзносовФОТИП,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатаЗарплаты(
	ТаблицыВыплатыЗарплатыИП.СписокВыплат, ТаблицыВыплатыЗарплатыИП.СписокПереплат,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатаЗарплаты(
	ТаблицыВыплатыПоДоговорамПодрядаИП.СписокВыплат, ТаблицыВыплатыПоДоговорамПодрядаИП.СписокПереплат,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатаЗарплаты(
	ТаблицыВыплатыДепонентовИП.СписокВыплат, ТаблицыВыплатыДепонентовИП.СписокПереплат,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПеречислениеПрочихУдержаний(
	ТаблицыПрочихУдержанийИП.СписокОплаченныхРасчетов, ТаблицыПрочихУдержанийИП.СписокОплаченныхУдержаний,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовИРасходовПредпринимателя.РегистрацияСведенийОбОплатеОСиНМА(
	ТаблицаОплатыОСиНМА, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	// ПЕРЕОЦЕНКА ВАЛЮТНЫХ ОСТАТКОВ
	ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкиДвиженийДокумента(
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияРасчетПереоценкиВалютныхСредств(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	ПараметрыПроведения.Реквизиты, Движения, Отказ);

	Если НЕ ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		СтатусыДокументов.СформироватьДвиженияСтатусовДокументов(
		ТаблицаСтатусовСчетов, ПараметрыПроведения.Реквизиты);
	КонецЕсли;

	// Отложенные расчеты с контрагентами.
	УчетВзаиморасчетовОтложенноеПроведение.ЗарегистрироватьОтложенныеРасчетыСКонтрагентами(
	ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);

	// Регистрация в последовательности
	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
	ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);

	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);

	ТаблицаРасчетаНДФЛАУСН = УчетАУСН.ПодготовитьТаблицуРасчетНДФЛ(ПараметрыПроведения.ПеречислениеЗарплаты,
	ПараметрыПроведения.ОплатаПоДоговорамПодряда, ПараметрыПроведения.Реквизиты);
	УчетАУСН.СформироватьДвиженияНДФЛ(ПараметрыПроведения.РеквизитыРасчетаНДФЛАУСН,
	ТаблицаРасчетаНДФЛАУСН, Движения);

КонецПроцедуры
