Процедура СформироватьДвиженияДляСпринт11_ОплатыПоСтатьямДДС(ТаблицаСпринт11_ОплатыПоСтатьямДДС, Движения, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаСпринт11_ОплатыПоСтатьямДДС) Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.Спринт11_ОплатыПоСтатьямДДС;
	
	Для Каждого СтрокаДвижения ИЗ ТаблицаСпринт11_ОплатыПоСтатьямДДС Цикл
		
		НоваяСтрока = Движение.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижения);
		
	КонецЦикла;
	
	Движения.Спринт11_ОплатыПоСтатьямДДС.Записывать = Истина;
	
КонецПроцедуры
